miniproject0/case4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0 0 0)     //0
    (4 0 0)     //1
    (4 1 0)     //2
    (0 1 0)     //3
    (0 0 0.1)   //4
    (4 0 0.1)   //5
    (4 1 0.1)   //6
    (0 1 0.1)   //7
    //(4 -1 0)    //8cA
    //(6 -1 0)    //8cB
    //(7 -1 0)    //8cC
    (12 -1 0)    //8
    (16 -1 0)   //9
    (16 1 0)    //10
    //(4 -1 0.1)  //11cA
    //(6 -1 0.1)  //11cB
    //(7 -1 0.1)    //11cC
    (12 -1 0.1)  //11
    (16 -1 0.1) //12
    (16 1 0.1)  //13
    (16 0 0)    //14
    (16 0 0.1)  //15
    (12 0 0)    //16
    (12 0 0.1)  //17
    (12 1 0)    //18
    (12 1 0.1)  //19
    (5 -0.1250 0) //20
    (5 0 0)     //21
    (10 -0.7500 0) //22
    (10 0 0)    //23
    (5 -0.1250 0.1) //24
    (5 0 0.1)   //25
    (10 -0.7500 0.1) //26
    (10 0 0.1)  //27
    (5 1 0)     //28
    (5 1 0.1)   //29
    (10 1 0)    //30
    (10 1 0.1)  //31
    //(4.5 -0.0625 0) //32
    //(4.5 0 0)   //33
    //(4.5 -0.0625 0.1) //34
    //(4.5 0 0.1) //35
    //(4.5 1 0)   //36
    //(4.5 1 0.1) //37
);

blocks
(
    hex (0 1 2 3 4 5 6 7) b4expansion (100 25 1) simpleGrading 
    (
        0.3333
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b0
    /*hex (1 33 36 2 5 35 37 6) afterexpansion1 (2 25 1) simpleGrading 
    (
        1
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1                                        
    )    //b11 */
    hex (1 21 28 2 5 25 29 6) aftexpansion2 (25 25 1) simpleGrading
    (
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b21
    hex (21 23 30 28 25 27 31 29) aftexpansion3 (125 25 1) simpleGrading
    (
        1
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b31
    hex (23 16 18 30 27 17 19 31) afterexpansion4 (75 25 1) simpleGrading
    (
        0.3333
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
                                    
        )
        1
    )   //b41
    hex (16 14 10 18 17 15 13 19) afterexpansion5 (100 25 1) simpleGrading
    (
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1                                                                                                  
    )   //b51
    /*hex (32 32 33 1 34 34 35 5) rampblock (2 25 1) simpleGrading
    (
        1
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )
        1
    )   //b12 */
    hex (20 20 21 1 24 24 25 5) rampblock2 (25 25 1) simpleGrading
    (
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )                            
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )
        1
    )   //b22
    hex (20 22 23 21 24 26 27 25) rampblock3 (125 25 1) simpleGrading 
    (
        1
        (
            (0.25 0.25 3)
            (0.75 0.75 1)            
        )
        1
    ) //b32
    hex (22 8 16 23 26 11 17 27) rampblock4 (75 25 1) simpleGrading 
    (
        0.3333
        (
            (0.25 0.25 3)
            (0.75 0.75 1)            
        )
        1
    ) //b42
    hex (8 9 14 16 11 12 15 17) aftexpansion6 (100 25 1) simpleGrading 
    (
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        ) 
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )         
        1
    )   //b52
);

boundary
(
    wallL
    {
        type wall;
        faces
        (
            (2 3 7 6)   //b0
            //(36 2 6 37) //b11
            (29 28 2 6) //b21
            (31 30 28 29) //b31
            (19 18 30 31) //b41
            (10 18 19 13) //b51
        );
    }
    wallR
    {
        type wall;
        faces
        (
            (0 1 5 4)   //b0
            (8 9 12 11) //b42
        );
    }
    wallExpansion
    {
        type wall;
        faces
        (
            //(1 32 34 5)  //b12
            (1 20 24 5)  //b22
            (20 22 26 24) //b32
            (22 8 11 26) //b42
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)   //b0
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 10 13 15)    //b41
            (9 14 15 12)     //b42
        );
    }
    twoD
    {
        type empty;
        faces
        (
            (4 5 6 7)   //b0
            (0 3 2 1)   //b0
            //(5 35 37 6) //b11
            //(2 36 33 1) //b11
            (5 25 29 6) //b21
            (2 28 21 1) //b21
            (25 27 31 29) //b31
            (28 30 23 21) //b31
            (27 17 19 31) //b41
            (30 18 16 23) //b41
            (17 15 13 19) //b51
            (18 10 14 16) //b51
            //(5 34 34 35)    //b12
            //(1 33 32 32)    //b12
            (5 24 24 25) //b22
            (1 21 20 20)  //b22
            (24 26 27 25) //b32
            (21 23 22 20) //b32
            (17 27 26 11) //b42
            (16 8 22 23)  //b42
            (11 12 15 17) //b52
            (16 14 9 8) //b52
        );
    }
    collapsedFaces
    {
        type empty;
        faces
        (
            (20 24 24 20)
        );
    }
);


// ************************************************************************* //
